Revit 2022 API
SetupEnergySimulationDialogResult Enumeration
 Specifies identifiers to indicate the return value of the SetupEnergySimulationDialog
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum SetupEnergySimulationDialogResult
Visual Basic
Public Enumeration SetupEnergySimulationDialogResult
Visual C++
public enum class SetupEnergySimulationDialogResult
Members
Member name | Description
Continue |  The user chose to continue from the dialog.
Cancel |  The user chose to cancel out of the dialog.
See Also
Autodesk.Revit.UI Namespace